/* Урок 1. Знакомство с языком программирования С#
Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3 */
Console.WriteLine("Enter a 1st number");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Enter f 2-d number");
int num2 = Convert.ToInt32(Console.ReadLine());
if (num1 > num2){
    Console.WriteLine($"Number {num1} is bigger than number {num2}");
}else if(num1 < num2){
    Console.WriteLine($"number {num1} is smaller than number {num2}");
}else{
    Console.WriteLine($"nubers are similar");
}
/* Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22 */

/* Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

4 -> да
-3 -> нет
7 -> нет */

/* Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

5 -> 2, 4
8 -> 2, 4, 6, 8 */